import 'package:sp_demo_tsd/models/all_models.dart';

List<Unit> units = [
  Unit(
    name: '1201/56 Кондитерский цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кондитерский заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кондитерский основной КФ Шелен'),
      Unit(name: 'Склад материалов Кондитерский цех КФ Шелен'),
      Unit(name: 'Склад сырья Кондитерский КФ Шелен'),
      Unit(name: 'Цех Кондитерский КФ Шелен'),
    ],
  ),
  Unit(
    name: '1202/56 Кулинарный цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кулинарный заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кулинарный охлаждёнка КФ Шелен'),
      Unit(name: 'Склад материалов Кулинарный цех КФ Шелен'),
      Unit(name: 'Склад сырья Кулинарный КФ Шелен'),
    ],
  ),
  Unit(
    name: '1205/56 Мясной цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП мяса птицы основной КФ Шелен'),
      Unit(name: 'Склад ГП мяса птицы транзит КФ Шелен'),
      Unit(name: 'Склад ГП мясной охлажденка КФ Шелен'),
      Unit(name: 'Склад ГП мясной заморозка КФ Шелен'),
      Unit(name: 'Склад ГП рыбный охлажденка КФ Шелен'),
      Unit(name: 'Склад материалов Мясной цех КФ Шелен'),
      Unit(name: 'Склад сырья мяса птицы основной КФ Шелен'),
      Unit(name: 'Склад сырья мяса птицы специи КФ Шелен'),
      Unit(name: 'Склад сырья мясной КФ Шелен'),
      Unit(name: 'Склад сырья мясной специи КФ Шелен'),
      Unit(name: 'Цех мяса птицы КФ Шелен'),
      Unit(name: 'Цех мясной КФ Шелен'),
    ],
  ),
  Unit(name: '1205/56 Пекарный цех КФ Шелен', units: [
    Unit(name: 'Склад ГП пекарный дополнительный КФ Шелен'),
    Unit(name: 'Склад ГП пекарный основной КФ Шелен'),
    Unit(name: 'Склад материалов Цех пекарный КФ'),
  ])
];

List<Unit> units2 = [
  Unit(
    name: '1202/56 Кулинарный цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кулинарный заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кулинарный охлаждёнка КФ Шелен'),
      Unit(name: 'Склад материалов Кулинарный цех КФ Шелен'),
      Unit(name: 'Склад сырья Кулинарный КФ Шелен'),
    ],
  ),
  Unit(
    name: '1205/56 Мясной цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП мяса птицы основной КФ Шелен'),
      Unit(name: 'Склад ГП мяса птицы транзит КФ Шелен'),
      Unit(name: 'Склад ГП мясной охлажденка КФ Шелен'),
      Unit(name: 'Склад ГП мясной заморозка КФ Шелен'),
      Unit(name: 'Склад ГП рыбный охлажденка КФ Шелен'),
      Unit(name: 'Склад материалов Мясной цех КФ Шелен'),
      Unit(name: 'Склад сырья мяса птицы основной КФ Шелен'),
      Unit(name: 'Склад сырья мяса птицы специи КФ Шелен'),
      Unit(name: 'Склад сырья мясной КФ Шелен'),
      Unit(name: 'Склад сырья мясной специи КФ Шелен'),
      Unit(name: 'Цех мяса птицы КФ Шелен'),
      Unit(name: 'Цех мясной КФ Шелен'),
    ],
  ),
  Unit(name: '1205/56 Пекарный цех КФ Шелен', units: [
    Unit(name: 'Склад ГП пекарный дополнительный КФ Шелен'),
    Unit(name: 'Склад ГП пекарный основной КФ Шелен'),
    Unit(name: 'Склад материалов Цех пекарный КФ'),
  ])
];

List<Unit> units3 = [
  Unit(
    name: '1201/56 Кондитерский цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кондитерский заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кондитерский основной КФ Шелен'),
      Unit(name: 'Склад материалов Кондитерский цех КФ Шелен'),
      Unit(name: 'Склад сырья Кондитерский КФ Шелен'),
      Unit(name: 'Цех Кондитерский КФ Шелен'),
    ],
  ),
  Unit(
    name: '1202/56 Кулинарный цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кулинарный заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кулинарный охлаждёнка КФ Шелен'),
      Unit(name: 'Склад материалов Кулинарный цех КФ Шелен'),
      Unit(name: 'Склад сырья Кулинарный КФ Шелен'),
    ],
  )
];

List<Unit> units4 = [
  Unit(
    name: '1201/56 Кондитерский цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кондитерский заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кондитерский основной КФ Шелен'),
      Unit(name: 'Склад материалов Кондитерский цех КФ Шелен'),
      Unit(name: 'Склад сырья Кондитерский КФ Шелен'),
      Unit(name: 'Цех Кондитерский КФ Шелен'),
    ],
  ),
  Unit(
    name: '1202/56 Кулинарный цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кулинарный заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кулинарный охлаждёнка КФ Шелен'),
      Unit(name: 'Склад материалов Кулинарный цех КФ Шелен'),
      Unit(name: 'Склад сырья Кулинарный КФ Шелен'),
    ],
  )
];
List<Unit> units5 = [
  Unit(
    name: '1201/56 Кондитерский цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кондитерский заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кондитерский основной КФ Шелен'),
      Unit(name: 'Склад материалов Кондитерский цех КФ Шелен'),
      Unit(name: 'Склад сырья Кондитерский КФ Шелен'),
      Unit(name: 'Цех Кондитерский КФ Шелен'),
    ],
  ),
  Unit(
    name: '1202/56 Кулинарный цех КФ Шелен',
    units: [
      Unit(name: 'Склад ГП кулинарный заморозка КФ Шелен'),
      Unit(name: 'Склад ГП кулинарный охлаждёнка КФ Шелен'),
      Unit(name: 'Склад материалов Кулинарный цех КФ Шелен'),
      Unit(name: 'Склад сырья Кулинарный КФ Шелен'),
    ],
  )
];
